'''
Нафтопереробний завод виробляє бензин двох марок A та B. 
Бензин марки A містить 60% нафтопродуктів 1-го сорту та 40% – 2-го сорту. 
Бензин марки B містить 80% нафтопродуктів 1-го сорту та 20% – 2-го сорту. 
Вивчення попиту показало, що добовий попит на бензин марки B не перевищує попиту на бензин марки A більш як на 20 тон. 
Встановлено також, що попит на бензин марки B не перевищує 40 т. на добу. 
Вартість 1 т бензину марки A – 140 у.г.о, бензину марки B – 90 у.г.о. 
Скласти математичну модель задачі, що дозволить розрахувати план виробництва бензину, за якого буде досягнуто
максимальний прибуток, якщо запас нафтопродуктів 1-го сорту – 50 т., 2-го сорту – 30 т.

Z = 140x + 90y -> max

x >= 0
y >= 0

0,6x + 0,8y<= 50
0,4x + 0,2y<= 30
y <= x+20 | -x+y<=20
y <= 40
'''

from scipy.optimize import linprog

profit_func_coefficients = [-140,-90]

A_ub = [
        [0.6, 0.8],
        [0.4, 0.2],
        [-1, 1],
        [0, 1]
]

B_ub = [50, 30, 20, 40]

x_bounds = (0, None)
y_bounds = (0, None)

result = linprog(profit_func_coefficients, A_ub=A_ub, b_ub=B_ub, bounds=[x_bounds, y_bounds], method='highs')

print(-result.fun)
print(f"X = {result.x[0]}")
print(f"Y = {result.x[1]}")